## dplyr
* 해들리 위컴이 만든 패키지
* 데이터프레임을 대상으로 데이터랭글링 작업에 빠른 속도와 많은 유용한 기능을 제공
* 데이터 전처리작업의 사실상 표준 패키지로 인정받음
* 데이터 전처리 작업은 동사로 정의된 각 함수를 통해서 이루어짐

    - select    : 열 선택

    - filter    : 조건 검색

    - group_by  : 데이터 그룹화

    - mutate    : 행/열 추가

    - summrise  : 데이터 집계

    - arrange   : 데이터 정렬

* 이러한 함수들은 magrittr 패키지에 의해 구현된 파이프(>) 패러다임을 이용해서 체인형식으로 연산을 수행할 수 있음
* 즉 먼저 수행한 함수의 결과를 다음으로 실행할 함수의 입력으로 보낼 수 있음
    - sum(titanic, na.rm=T)   # 기존방식
    - titanic %>% sum(na.rm=T) # 파이프 방식


* 파이프 기호(%>%)를 입력할 때는 단축키 ctrl + shift + M 를 사용함

### dplyr 패키지 설치(터미널에서 입력)
+ install.packages('dplyr')

In [51]:
library(dplyr)

In [52]:
load('sungjuk.rdata')

#### select(열선택)
+ 영어성적 출력

In [5]:
sungjuk %>% select(eng)  #select(컬럼명)

  eng
1 90
2 95
3 69
4 78

In [7]:
sungjuk %>% select(eng, mat, sci)

  eng mat sci
1 90  85  90
2 95  96  80
3 69  49  70
4 78  95  60

In [8]:
sungjuk %>% select(-eng, -mat, -sci)

  name
1 John
2 Tom
3 Mark
4 Jane

### filter(조건검색)

In [9]:
sungjuk$class <- c(1,2,1,3) # 클래스 컬럼 추가

In [10]:
# class가 1인 학생 조회

In [11]:
sungjuk %>% filter(class == 1)

  name eng mat sci class
1 John 90  85  90  1
2 Mark 69  49  70  1

In [13]:
sungjuk %>% filter(class != 1)

  name eng mat sci class
1 Tom  95  96  80  2
2 Jane 78  95  60  3

In [14]:
sungjuk %>% filter(eng > 70)

  name eng mat sci class
1 John 90  85  90  1
2 Tom  95  96  80  2
3 Jane 78  95  60  3

In [15]:
sungjuk %>% filter(eng >80 & mat == 85)

  name eng mat sci class
1 John 90  85  90  1

In [19]:
sungjuk %>% filter(eng >80,mat == 85)

  name eng mat sci class
1 John 90  85  90  1

In [18]:
sungjuk %>% filter(eng >80 & mat == 85) %>% select(name, class)

  name class
1 John 1

In [147]:
library(ggplot2)

In [148]:
mpg

    model              manufacturer allmpg avgmpg
1   a4                 audi         47     23.5
2   a4                 audi         50     25.0
3   a4                 audi         51     25.5
4   a4                 audi         51     25.5
5   a4                 audi         42     21.0
6   a4                 audi         44     22.0
7   a4                 audi         45     22.5
8   a4 quattro         audi         44     22.0
9   a4 quattro         audi         41     20.5
10  a4 quattro         audi         48     24.0
11  a4 quattro         audi         46     23.0
12  a4 quattro         audi         40     20.0
13  a4 quattro         audi         42     21.0
14  a4 quattro         audi         42     21.0
15  a4 quattro         audi         40     20.0
16  a6 quattro         audi         39     19.5
17  a6 quattro         audi         42     21.0
18  a6 quattro         audi         39     19.5
19  c1500 suburban 2wd chevrolet    34     17.0
20  c1500 suburban 2wd chevrolet    26     13.0
21  c1500 suburban 2wd chevrolet    34     17.0
22  c1500 suburban 2wd chevrolet    30     15.0
23  c1500 suburban 2wd chevrolet    29     14.5
24  corvette           chevrolet    42     21.0
25  corvette           chevrolet    38     19.0
26  corvette           chevrolet    42     21.0
27  corvette           chevrolet    40     20.0
28  corvette           chevrolet    39     19.5
29  k1500 tahoe 4wd    chevrolet    33     16.5
30  k1500 tahoe 4wd    chevrolet    25     12.5
⋮   ⋮                  ⋮            ⋮      ⋮
205 toyota tacoma 4wd  toyota       34     17.0
206 toyota tacoma 4wd  toyota       33     16.5
207 toyota tacoma 4wd  toyota       36     18.0
208 gti                volkswagen   50     25.0
209 gti                volkswagen   45     22.5
210 gti                volkswagen   50     25.0
211 gti                volkswagen   51     25.5
212 gti                volkswagen   41     20.5
213 jetta              volkswagen   77     38.5
214 jetta              volkswagen   50     25.0
215 jetta              volkswagen   45     22.5
216 jetta              volkswagen   51     25.5
217 jetta              volkswagen   50     25.0
218 jetta              volkswagen   50     25.0
219 jetta              volkswagen   50     25.0
220 jetta              volkswagen   39     19.5
221 jetta              volkswagen   41     20.5
222 new beetle         volkswagen   79     39.5
223 new beetle         volkswagen   70     35.0
224 new beetle         volkswagen   50     25.0
225 new beetle         volkswagen   45     22.5
226 new beetle         volkswagen   48     24.0
227 new beetle         volkswagen   49     24.5
228 passat             volkswagen   50     25.0
229 passat             volkswagen   47     23.5
230 passat             volkswagen   47     23.5
231 passat             volkswagen   50     25.0
232 passat             volkswagen   42     21.0
233 passat             volkswagen   44     22.0
234 passat             volkswagen   43     21.5

In [146]:
mpg %>% select(class, cty) %>% print(n=5)

ERROR: Error: Can't subset columns that don't exist.
✖ Column `class` doesn't exist.

In [145]:
shwy <- mpg %>% select(class, cty) %>% filter(class == 'suv')
mean(shwy$cty)

ERROR: Error: Can't subset columns that don't exist.
✖ Column `class` doesn't exist.

In [85]:
chwy <- mpg %>% filter(class == 'compact') %>% select(class, cty)
round(mean(chwy$cty),2)

[1] 20.13

In [93]:
diswy <- mpg %>% filter(displ == 4) %>% select(manufacturer, displ, hwy)
mean(diswy$hwy)

[1] 19.6

In [92]:
diswy2 <- mpg %>% filter(displ == 5) %>% select(manufacturer, displ, hwy)
mean(diswy2$hwy)

[1] 17

In [102]:
manucty <- mpg %>% filter(manufacturer == 'audi') %>% select(manufacturer, cty)
round(mean(manucty$cty),2)

[1] 17.61

In [101]:
manucty1 <- mpg %>% filter(manufacturer == 'toyota') %>% select(manufacturer, cty)
round(mean(manucty1$cty),2)

[1] 18.53

In [108]:
manuhwy1 <- mpg %>% filter(manufacturer == 'chevrolet') %>% select(manufacturer, hwy)
round(mean(manuhwy1$hwy),2)

[1] 21.89

In [109]:
manuhwy2 <- mpg %>% filter(manufacturer == 'ford') %>% select(manufacturer, hwy)
round(mean(manuhwy2$hwy),2)

[1] 19.36

In [110]:
manuhwy3 <- mpg %>% filter(manufacturer == 'honda') %>% select(manufacturer, hwy)
round(mean(manuhwy3$hwy),2)

[1] 32.56

### 행, 열 추가

In [112]:
sungjuk

  name eng mat sci
1 John 90  85  90
2 Tom  95  96  80
3 Mark 69  49  70
4 Jane 78  95  60

In [129]:
sungjuk <- sungjuk %>% mutate(tot = sci + eng + mat, avg = round(tot/3,1))
sungjuk

  name eng mat sci tot avg  round(avg = tot/3) 2
1 John 90  85  90  265 88.3 88                 2
2 Tom  95  96  80  271 90.3 90                 2
3 Mark 69  49  70  188 62.7 63                 2
4 Jane 78  95  60  233 77.7 78                 2

In [137]:
sungjuk <- sungjuk %>% mutate('round(avg = tot/3)' = NULL)

In [138]:
sungjuk

  name eng mat sci tot avg
1 John 90  85  90  265 88.3
2 Tom  95  96  80  271 90.3
3 Mark 69  49  70  188 62.7
4 Jane 78  95  60  233 77.7

In [ ]:
mpg <- mpg %>% mutate(allmpg = cty + hwy, avgmpg = allmpg /2)